План_полетов_файловый_edt/src/Documents/ДанныеСОП/ДанныеСОП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДанныеСОП</name>
  <registerRecords>InformationRegister.СоздателиФормаС</registerRecords>
  <registerRecords>InformationRegister.СвязьДанныеСОППрилетВылет</registerRecords>
  <registerRecords>InformationRegister.ОтветственныеФормаС</registerRecords>
  <attributes>
    <name>ПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыМалыши</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКладь</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Багаж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Груз</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIPПассажирыВзрослые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>VIPПассажирыДети</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>DocumentRef.Прилеты</types>
      <types>DocumentRef.Вылеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>CatalogRef.Рейсы</types>
    </type>
  </attributes>
</mdclass:Document>

План_полетов_файловый_edt/src/Documents/ДанныеСОП/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Объект.Документ = Элемент.ТекущиеДанные.Ссылка;
	Объект.Рейс = Элемент.ТекущиеДанные.Рейс;
	Если (Элемент.ТекущиеДанные.ТипДокумента = "Прилет") Тогда 
		Элементы.VIPПассажирыВзрослые.Видимость = Ложь;
		Элементы.VIPПассажирыДети.Видимость = Ложь;		
	Иначе 
		Элементы.VIPПассажирыВзрослые.Видимость = Истина;
		Элементы.VIPПассажирыДети.Видимость = Истина;		
	КонецЕсли;
КонецПроцедуры
